# vim:ft=ruby

tap 'homebrew/cask-fonts'

# Applications
cask 'wezterm'
cask '1password/tap/1password-cli'
cask 'hammerspoon'

# font
cask 'font-jetbrains-mono-nerd-font'
cask 'font-monaspace'

# tools
brew 'bash'
brew 'coreutils'
brew 'chroma'
brew 'curl'
brew 'docker'
brew 'eza'
brew 'fzf'
brew 'gh'
brew 'gnupg'
brew 'go'
brew 'golangci-lint'
brew 'htop'
brew 'jq'
brew 'k9s'
brew 'lua'
brew 'luajit'
brew 'neovim'
brew 'python'
brew 'ripgrep'
brew 'yq'
brew 'zsh'
