# vim:ft=ruby

if OS.mac?
  tap "homebrew/cask-fonts"

  # Applications
  cask "1password/tap/1password-cli"

  # font
  cask "font-jetbrains-mono-nerd-font"
end

brew "chroma"
brew "docker"
brew "exa"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "htop"
brew "jq"
brew "k9s"
brew "neovim"
brew "python"
brew "ripgrep"
brew "shellcheck"
brew "zsh"
brew "zsh-syntax-highlighting"
