# vim:ft=ruby

tap "homebrew/cask-fonts"

# Applications
cask "wezterm"
cask "iterm2"
cask "1password/tap/1password-cli"
cask "hammerspoon"

# font
cask "font-jetbrains-mono-nerd-font"

# tools
brew "coreutils"
brew "chroma"
brew "docker"
brew "exa"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "htop"
brew "jq"
brew "k9s"
brew "lua"
brew "luajit"
brew "neovim"
brew "python"
brew "ripgrep"
brew "tree"
brew "yq"
brew "zsh"
brew "zsh-syntax-highlighting"
